# Series

In [1]:
import pandas as pd

In [2]:
series_test = pd.Series([1,2,3])
series_test

0    1
1    2
2    3
dtype: int64

In [3]:
series_test2 = pd.Series([100,200,300],dtype=float)
series_test2

0    100.0
1    200.0
2    300.0
dtype: float64

In [4]:
series_test3 = pd.Series({2016:32, 2017:30, 2018:34})
print("Ej: Ventas por año")
series_test3

Ej: Ventas por año

2016    32
2017    30
2018    34
dtype: int64

In [5]:
print(f'las ventas en el año 2016 fueron de: {series_test3[2016]}')

las ventas en el año 2016 fueron de: 32

# DataFrames

In [6]:
frame_test = pd.DataFrame([[12, 34, 35, 34],
                           [11, 37, 38, 23],
                           [16, 38, 60, 28]])
frame_test

    0   1   2   3
0  12  34  35  34
1  11  37  38  23
2  16  38  60  28

In [7]:
#columnas
frame_test2 = pd.DataFrame([[12, 34, 35, 34],
                           [11, 37, 38, 23],
                           [16, 38, 60, 28]], columns=[2015,2016,2017,2018])
frame_test2

   2015  2016  2017  2018
0    12    34    35    34
1    11    37    38    23
2    16    38    60    28

In [8]:
#columna: fila
frame_test1 = pd.DataFrame({2016: [12, 34, 35, 34],
                            2017: [11, 37, 38, 23],
                            2018: [16, 38, 60, 28],})
print('Ventas de cada año por quarter')
frame_test1

Ventas de cada año por quarter

   2016  2017  2018
0    12    11    16
1    34    37    38
2    35    38    60
3    34    23    28

In [9]:
#columna: indice:fila
frame_test_3 = pd.DataFrame({2016: {'Q1': 12, 'Q2': 34, 'Q3': 35, 'Q4': 34},
                             2017: {'Q1': 11, 'Q2': 37, 'Q3': 38, 'Q4': 23},
                             2018: {'Q1': 16, 'Q2': 38, 'Q3': 60, 'Q4': 28},})
print('Ventas de cada año por quarter')
frame_test_3

Ventas de cada año por quarter

    2016  2017  2018
Q1    12    11    16
Q2    34    37    38
Q3    35    38    60
Q4    34    23    28

## Indices y seleccion en DataFrames

### Dictionary Like

In [10]:
año_2016 = frame_test_3[2016]
año_2016

Q1    12
Q2    34
Q3    35
Q4    34
Name: 2016, dtype: int64

In [11]:
type(año_2016)

pandas.core.series.Series

In [12]:
ultimos_años = frame_test_3[[2017, 2018]]
ultimos_años

    2017  2018
Q1    11    16
Q2    37    38
Q3    38    60
Q4    23    28

In [13]:
type(ultimos_años)

pandas.core.frame.DataFrame

### Numpy like

Usando **iloc** incluimos los extremos

In [24]:
ultimos_q = frame_test_3.iloc[2:]
print('Los últimos Quarters de cada año')
ultimos_q

Los últimos Quarters de cada año

    2016  2017  2018
Q3    35    38    60
Q4    34    23    28

In [30]:
ultimo_q_2018 = frame_test_3.iloc[3:,2:]
ultimo_q_2018

    2018
Q4    28

In [36]:
ultimo_q_2016 = frame_test_3.iloc[3:,:1]
ultimo_q_2016

    2016
Q4    34

### Label Based

In [41]:
primeros_q_ultimos_años = frame_test_3.loc[:'Q2', '2017':]
primeros_q_ultimos_años

    2017  2018
Q1    11    16
Q2    37    38

# Read Data

### De esta forma podemos leer un csv como un DF usandos pandas

In [42]:
el_tiempo = pd.read_csv('web_scrapper/eltiempo_2018,_12_06_articles.csv',encoding='utf-8')
el_tiempo.head()

,body,title
0,\n\n\n\nLa Fiscalía confirmó este miércoles qu...,Se destraba acuerdo para que exejecutivos de O...
1,\n\n\n\nEl colombiano Juan Carlos Ramírez Abad...,"'Chupeta', el testigo del gobierno de EE. UU. ..."
2,\n\n\n\nTras ser sorprendido jugando en su tel...,¿Quién es el congresista 'pillado' jugando en ...
3,\n\n\n\nLo encontramos en el barrio Girardot. ...,‘Un día amanecí más viejo y durmiendo en la te...
4,\n\n\n\nDucha de agua fría para la lucha contr...,Las emisiones de CO2 alcanzaron un nivel récor...